#+SETUPFILE: ../etc/org_mode_SETUPFILE.org
#+Title: Atividade TLBD3 - Loja de Informática
* Introdução
  

* preparando o ambiente :noexport:
** Instalação do mssqlserver no linux
*** Fazendo pull da imagem do mssqlserver
    Primeiro você deve fazer o pull da imagem container
    Claro que pra usar o comando docker vc precisa instalar ele
    também. No meu caso estou usando a versão indicada abaixo. 
    Tem muitos tutorials sobre como instalar o docker no google.
    #+name: docker version
    #+begin_src sh  :eval exports  :results output replace  :exports both
    docker --version
    #+end_src

    #+RESULTS:
    : Docker version 1.12.6, build ae7d637/1.12.6


    Com o docker funcionando, você pode fazer o pull da imagem do
    mssqlserver
    #+name: docker pull mssqlserver
    #+begin_src sh  :results output replace  :exports both
    docker pull microsoft/mssql-server-linux:latest
    #+end_src

    #+RESULTS:
    #+begin_example
    latest: Pulling from microsoft/mssql-server-linux
    f6fa9a861b90: Already exists
    da7318603015: Already exists
    6a8bd10c9278: Already exists
    d5a40291440f: Already exists
    bbdd8a83c0f1: Already exists
    3a52205d40a6: Already exists
    6192691706e8: Already exists
    1a658a9035fb: Already exists
    827975ce0c02: Already exists
    ea7199b7fbb6: Already exists
    Digest: sha256:ff4bd7961f6c788d980953ae4edbb7cfc7e604dfe2b702fc26548080254c522a
    Status: Image is up to date for microsoft/mssql-server-linux:latest
    #+end_example

*** rodando o mssqllserver
   Agora você tem que rodar o container, e depois, checar se o seu container está rodando
  #+name docker ps
  #+begin_src sh
  docker ps
  #+end_src

  #+RESULTS:
  : CONTAINER ID        IMAGE               COMMAND             CREATED             STATUS              PORTS               NAMES

  Aqui a gente roda nosso container pra obter uma instancia do
  mssqlserver rodando. Repare que o sqlserver tera a disposicao o
  diretorio /sql_scripts onde esta nossos scripts que vamos rodar.
  #+name docker run mssqlserver
  #+begin_src sh
    docker run --name mssql-server -v $(pwd)/sql_scripts/:/sql_scripts -e 'ACCEPT_EULA=Y' -e 'SA_PASSWORD=Aluno#123' -p 1433:1433 -d microsoft/mssql-server-linux && docker logs mssql-server  
  #+end_src

  #+RESULTS:
  : 48726b8c1f1bf8698f80524e25f9006e67ce720dafcc2fe613884f527b3cf1d1

  
  Será que nosso container tem mesmo um diretório /sql_scripts?
  Tem que ter né, porque é lá que estarão nossos script que vamos
  rodar. Vamos conferir se tem mesmo então... Pra isso é só dar um ls
  no container.
  #+name docker verifica pasta sql_script 
  #+begin_src sh
    docker exec mssql-server ls
  #+end_src

  #+RESULTS:
  | bin         |
  | boot        |
  | core        |
  | dev         |
  | etc         |
  | home        |
  | install.sh  |
  | lib         |
  | lib64       |
  | media       |
  | mnt         |
  | opt         |
  | proc        |
  | root        |
  | run         |
  | sbin        |
  | sql_scripts |
  | srv         |
  | sys         |
  | tmp         |
  | usr         |
  | var         |
  
  Então pela saída acima tá comprovado que nossa pastinha de scripts
  tá... 


  Agora você pode dar uma conferida se a porta 1433 está aberta. Pra
  isso você pode usar o nmap. Tem que instala-lo.
  #+name checando porta 1433
  #+begin_src sh  :eval exports  :results output replace  :exports both
  nmap 172.17.0.1
  #+end_src

  #+RESULTS:
  : 
  : Starting Nmap 7.40 ( https://nmap.org ) at 2018-02-10 11:42 -02
  : Nmap scan report for 172.17.0.1
  : Host is up (0.00042s latency).
  : Not shown: 999 closed ports
  : PORT     STATE SERVICE
  : 1433/tcp open  ms-sql-s
  : 
  : Nmap done: 1 IP address (1 host up) scanned in 0.22 seconds

** dropando o banco pra quando quizer comecar do zero
    Esse script serve simplesmente pra dropar o banco
    A gente dropa o banco as vezes quando queremos rodar os nossos
    scripts do zero
    #+name: drop_database
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/drop_database.sql
    #+end_src

    #+RESULTS: drop_database


* o comando sqlcmd
  #+name: sqlcmd
  #+begin_src sh :results output replace  :exports both
 docker exec mssql-server /opt/mssql-tools/bin/sqlcmd
#+end_src

#+RESULTS:
#+begin_example
Microsoft (R) SQL Server Command Line Tool
Version 13.1.0007.0 Linux
Copyright (c) 2012 Microsoft. All rights reserved.

usage: sqlcmd            [-U login id]          [-P password]
  [-S server or Dsn if -D is provided] 
  [-H hostname]          [-E trusted connection]
  [-N Encrypt Connection][-C Trust Server Certificate]
  [-d use database name] [-l login timeout]     [-t query timeout]
  [-h headers]           [-s colseparator]      [-w screen width]
  [-a packetsize]        [-e echo input]        [-I Enable Quoted Identifiers]
  [-c cmdend]
  [-q "cmdline query"]   [-Q "cmdline query" and exit]
  [-m errorlevel]        [-V severitylevel]     [-W remove trailing spaces]
  [-u unicode output]    [-r[0|1] msgs to stderr]
  [-i inputfile]         [-o outputfile]
  [-k[1|2] remove[replace] control characters]
  [-y variable length type display width]
  [-Y fixed length type display width]
  [-p[1] print statistics[colon format]]
  [-R use client regional setting]
  [-K application intent]
  [-M multisubnet failover]
  [-b On error batch abort]
  [-D Dsn flag, indicate -S is Dsn] 
  [-X[1] disable commands, startup script, environment variables [and exit]]
  [-x disable variable substitution]
  [-? show syntax summary]
#+end_example


* Criacao do Banco de dados
  O script abaixo é o conteúdo do arquivo  script
  Exec_sp_databases.sql.  
  Seque o conteúdo do script. A gente vai
  passar esse script pro comando sqlcmd que vai executá-lo e mostrar
  o resultado logo abaixo.
  
  #+INCLUDE: "./sql_scripts/Exec_sp_databases.sql" src sql

  Como você pode perceber, o conteúdo do nosso script é simplesmente
  a execução da Store Procedure sp_databases. O resultado é igual o
  show databases do mysql, por exemplo.

    #+name: sp_databases
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/Exec_sp_databases.sql
    #+end_src

    #+RESULTS:
    : DATABASE_NAME                                                                                                                    DATABASE_SIZE REMARKS                                                                                                                                                                                                                                                       
    : -------------------------------------------------------------------------------------------------------------------------------- ------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    : lojainfo                                                                                                                                 16384 NULL                                                                                                                                                                                                                                                          
    : master                                                                                                                                    6144 NULL                                                                                                                                                                                                                                                          
    : model                                                                                                                                    16384 NULL                                                                                                                                                                                                                                                          
    : msdb                                                                                                                                     14144 NULL                                                                                                                                                                                                                                                          
    : tempdb                                                                                                                                   16384 NULL                                                                                                                                                                                                                                                          

Olhando aí o resultado a gente vê que não tem o nosso banco. 
Vamos criá-lo...

    #+name: create_database
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_database.sql
    #+end_src

    #+RESULTS:
    : DATABASE_NAME                                                                                                                    DATABASE_SIZE REMARKS                                                                                                                                                                                                                                                       
    : -------------------------------------------------------------------------------------------------------------------------------- ------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    : lojainfo                                                                                                                                 16384 NULL                                                                                                                                                                                                                                                          
    : master                                                                                                                                    6144 NULL                                                                                                                                                                                                                                                          
    : model                                                                                                                                    16384 NULL                                                                                                                                                                                                                                                          
    : msdb                                                                                                                                     14144 NULL                                                                                                                                                                                                                                                          
    : tempdb                                                                                                                                   16384 NULL                                                                                                                                                                                                                                                          


Opa, demos um create database e agora podemos ver que temos o banco.


* Criação das tabelas
    #+name: script_create_tables
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_tables.sql
    #+end_src

    #+RESULTS:
    : Changed database context to 'lojainfo'.
    : TABLE_CATALOG                                                                                                                    TABLE_SCHEMA                                                                                                                     TABLE_NAME                                                                                                                       TABLE_TYPE
    : -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------
    : lojainfo                                                                                                                         dbo                                                                                                                              tb_clientes                                                                                                                      BASE TABLE
    : lojainfo                                                                                                                         dbo                                                                                                                              tb_hardware                                                                                                                      BASE TABLE
    : lojainfo                                                                                                                         dbo                                                                                                                              tb_vendas                                                                                                                        BASE TABLE
    : lojainfo                                                                                                                         dbo                                                                                                                              tb_vendas_itens                                                                                                                  BASE TABLE
    : 
    : (4 rows affected)



* Testa tabelas e mostra necessidade dos relacionamentos

  Agora a gente vai demonstrar que dá pra inserir registros na nossa
  tabela inserindo e depois dando um select.

Você vai aprender com esse script também que apesar de a gente ter
nossas tabelas não dá pra usar ainda. Vc vai ver o erro de inserir na
tabela uma venda pra um cliente que não existe. :( 
A próxima sessão dessa atividade vai mostrar como resolver isso.

    #+name: testa_tabelas
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_tables_tests.sql
    #+end_src

    #+RESULTS: testa_tabelas
    #+begin_example
    Changed database context to 'lojainfo'.
    id_cliente  nome                                               endereco                                                                                             fone            email                                                                 
    ----------- -------------------------------------------------- ---------------------------------------------------------------------------------------------------- --------------- ----------------------------------------------------------------------

    (0 rows affected)
    id_hardware descricao                                          preco_unit           qtde_atual  qtde_minima img                                                                                                                                                                                                                                                             
    ----------- -------------------------------------------------- -------------------- ----------- ----------- ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    (0 rows affected)
    Inserindo alguns clientes...

    (1 rows affected)
    Inserindo alguns hardwares...

    (1 rows affected)

    (1 rows affected)

    (1 rows affected)
    Mostrando os clientes inseridos
    id_cliente  nome                                               endereco                                                                                             fone            email                                                                 
    ----------- -------------------------------------------------- ---------------------------------------------------------------------------------------------------- --------------- ----------------------------------------------------------------------
              1 jeferson                                           av eteczl 1                                                                                          11-99999-9999   email...                                                              

    (1 rows affected)
    Mostrando os hardwares inseridos
    id_hardware descricao                                          preco_unit           qtde_atual  qtde_minima img                                                                                                                                                                                                                                                             
    ----------- -------------------------------------------------- -------------------- ----------- ----------- ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              1 gabinete                                                             50          10          10 NULL                                                                                                                                                                                                                                                            
              2 processador                                                          50          10          10 NULL                                                                                                                                                                                                                                                            
              3 placa mae                                                            50          10          10 NULL                                                                                                                                                                                                                                                            

    (3 rows affected)
    :( Aqui temos um problema inserindo uma venda pro cliente 500 sendo que o cliente 500 nao existe

    (1 rows affected)
    id_venda    id_cliente  data             vlr_total  desconto   vlr_pago  
    ----------- ----------- ---------------- ---------- ---------- ----------
              1         500       2018-10-02      80.00      10.00      70.00

    (1 rows affected)
    #+end_example


Entao, perceba vc que id_cliente nao tem cadastrado. Entao isso torna
o banco inconsistente. Não queremos isso. O seu diretor não quer
isso. Vc tem que usar uma constraint pra que o banco nao deixe isso
acontecer, ou seja, que o banco retorne uma mensagem pra quem for o
engraçadinho ou mal informado que for fazer isso.
  
Então preste atenção na próxima sessão dessa atividade pra você saber
como fazer isso blz?


* Relacionamentos

  Bom, agora a gente vai resolver aquele problema da venda pro cliente
  que não existia.
  A gente vai incluir uma constraint chamada foreign key, que vc já
  conhece, claro de tlbd1.

    #+name: script_constraints
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_contraints.sql
    #+end_src

    #+RESULTS:
    #+begin_example
    Changed database context to 'lojainfo'.
    Temos que remover aquela venda ERRADA
    pra poder inserir a nossa FK

    (1 rows affected)
    Agora sim vamos criar os relacionamentos
    Vamos ver as definicoes das tabelas tb_venas e tb_vendas_itens
    Name                                                                                                                             Owner                                                                                                                            Type                            Created_datetime       
    -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------------------------- -----------------------
    tb_vendas                                                                                                                        dbo                                                                                                                              user table                      2018-02-10 23:31:10.730


    Column_name                                                                                                                      Type                                                                                                                             Computed                            Length      Prec  Scale Nullable                            TrimTrailingBlanks                  FixedLenNullInSource                Collation                                                                                                                       
    -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------------------------------- ----------- ----- ----- ----------------------------------- ----------------------------------- ----------------------------------- --------------------------------------------------------------------------------------------------------------------------------
    id_venda                                                                                                                         int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    id_cliente                                                                                                                       int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    data                                                                                                                             date                                                                                                                             no                                            3 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    vlr_total                                                                                                                        decimal                                                                                                                          no                                            5 8     2     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    desconto                                                                                                                         decimal                                                                                                                          no                                            5 8     2     yes                                 (n/a)                               (n/a)                               NULL                                                                                                                            
    vlr_pago                                                                                                                         decimal                                                                                                                          no                                            5 8     2     yes                                 (n/a)                               (n/a)                               NULL                                                                                                                            

    Identity                                                                                                                         Seed                                     Increment                                Not For Replication
    -------------------------------------------------------------------------------------------------------------------------------- ---------------------------------------- ---------------------------------------- -------------------
    id_venda                                                                                                                                                                1                                        1                   0

    RowGuidCol                                                                                                                      
    --------------------------------------------------------------------------------------------------------------------------------
    No rowguidcol column defined.                                                                                                   

    Data_located_on_filegroup                                                                                                       
    --------------------------------------------------------------------------------------------------------------------------------
    PRIMARY                                                                                                                         

    index_name                                                                                                                       index_description                                                                                                                                                                                                  index_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
    -------------------------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    PK__tb_venda__4595B5ABE3B1928F                                                                                                   clustered, unique, primary key located on PRIMARY                                                                                                                                                                  id_venda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      

    constraint_type                                                                                                                                                                                                                                                  constraint_name                                                                                                                  delete_action update_action status_enabled status_for_replication constraint_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
    ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------- ------------- -------------- ---------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    FOREIGN KEY                                                                                                                                                                                                                                                      fk_vda_cli                                                                                                                       No Action     No Action     Enabled        Is_For_Replication     id_cliente                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
                                                                                                                                                                                                                                                                                                                                                                                                                                                                        REFERENCES lojainfo.dbo.tb_clientes (id_cliente)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              
    PRIMARY KEY (clustered)                                                                                                                                                                                                                                          PK__tb_venda__4595B5ABE3B1928F                                                                                                   (n/a)         (n/a)         (n/a)          (n/a)                  id_venda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      

    Table is referenced by foreign key                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
    ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    lojainfo.dbo.tb_vendas_itens: fk_itens_vda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          
    No views with schema binding reference table 'tb_vendas'.
    Name                                                                                                                             Owner                                                                                                                            Type                            Created_datetime       
    -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------------------------- -----------------------
    tb_vendas_itens                                                                                                                  dbo                                                                                                                              user table                      2018-02-10 23:31:10.730


    Column_name                                                                                                                      Type                                                                                                                             Computed                            Length      Prec  Scale Nullable                            TrimTrailingBlanks                  FixedLenNullInSource                Collation                                                                                                                       
    -------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ----------------------------------- ----------- ----- ----- ----------------------------------- ----------------------------------- ----------------------------------- --------------------------------------------------------------------------------------------------------------------------------
    id_item                                                                                                                          int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    id_venda                                                                                                                         int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    id_hardware                                                                                                                      int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    qtde_item                                                                                                                        int                                                                                                                              no                                            4 10    0     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            
    total_item                                                                                                                       decimal                                                                                                                          no                                            5 8     2     no                                  (n/a)                               (n/a)                               NULL                                                                                                                            

    Identity                                                                                                                         Seed                                     Increment                                Not For Replication
    -------------------------------------------------------------------------------------------------------------------------------- ---------------------------------------- ---------------------------------------- -------------------
    id_item                                                                                                                                                                 1                                        1                   0

    RowGuidCol                                                                                                                      
    --------------------------------------------------------------------------------------------------------------------------------
    No rowguidcol column defined.                                                                                                   

    Data_located_on_filegroup                                                                                                       
    --------------------------------------------------------------------------------------------------------------------------------
    PRIMARY                                                                                                                         

    index_name                                                                                                                       index_description                                                                                                                                                                                                  index_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    
    -------------------------------------------------------------------------------------------------------------------------------- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    PK__tb_venda__87C9438B23108F7A                                                                                                   clustered, unique, primary key located on PRIMARY                                                                                                                                                                  id_item                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       

    constraint_type                                                                                                                                                                                                                                                  constraint_name                                                                                                                  delete_action update_action status_enabled status_for_replication constraint_keys                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               
    ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------------------------------------------------------------------------------------------------------------------------------- ------------- ------------- -------------- ---------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    FOREIGN KEY                                                                                                                                                                                                                                                      fk_itens_vda                                                                                                                     No Action     No Action     Enabled        Is_For_Replication     id_venda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      
                                                                                                                                                                                                                                                                                                                                                                                                                                                                        REFERENCES lojainfo.dbo.tb_vendas (id_venda)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  
    PRIMARY KEY (clustered)                                                                                                                                                                                                                                          PK__tb_venda__87C9438B23108F7A                                                                                                   (n/a)         (n/a)         (n/a)          (n/a)                  id_item                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       

    No foreign keys reference table 'tb_vendas_itens', or you do not have permissions on referencing tables.
    No views with schema binding reference table 'tb_vendas_itens'.
    #+end_example


* Testando relacionamentos

  Se vc for ver o resultado do script, mais especificamente, a
  inserção de uma venda pra um cliente que não existe, você vai ver
  que o sqlserver te avisou o seguinte:

  The INSERT statement conflicted with the FOREIGN KEY constraint "fk_vda_cli". The conflict occurred in database "lojainfo", table "dbo.tb_clientes", column 'id_cliente'.

O que o sqlserver tá querendo te dizer é o seguinte:
o statemente insert gerou um conflito com a FK   "fk_vda_cli"

Obviamente não foi possível inserir essa venda no mínimo problemática
já que o select mostra que a tabela venda não retornou registros.
    #+name: Test_relacionamentos
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/create_constraints_tests.sql
    #+end_src

    #+RESULTS: Test_relacionamentos
    : Changed database context to 'lojainfo'.
    : Vamos inserir denovo aquela venda pra um cliente que nao existe
    : Msg 547, Level 16, State 1, Server 48726b8c1f1b, Line 3
    : The INSERT statement conflicted with the FOREIGN KEY constraint "fk_vda_cli". The conflict occurred in database "lojainfo", table "dbo.tb_clientes", column 'id_cliente'.
    : The statement has been terminated.
    : id_venda    id_cliente  data             vlr_total  desconto   vlr_pago  
    : ----------- ----------- ---------------- ---------- ---------- ----------
    : 
    : (0 rows affected)


* Agora inserindo registros
  Nessa sessão a gente vai inserir clientes, hardwares que serão
  comprados por clientes, as vendas e os itens de cada venda.
  Na verdade vamos registrar uma compra do Jeferson, de 10 unidades de
  cada item e do carlos com 1 unidade de cada item.
  Só uma nota importante. lembra que a gente tinha incluído um cliente
  só pra mostrar que nossa tabela existia e que já dava pra cadastrar
  um cliente? isso foi em uma das primeiras sessões, a da criação das
  tabelas.
  Quando a gente insere agora todos os registros a gente apaga tudo
  que havíamos inserido antes e por isso a chave primária do primeiro
  cliente pra nós agora (que vai sser o Jefesron é 2) e não 1. Porque
  ele já não é o primeiro cliente.
  Esssa é uma oportunidade pra vc compreender agora o funcinamento de
  chaves primárias e autonumeração. 

  #+Name: Tabela de vendas...
 | vda_id | Cliente | data       | vlr_total | desconto | vlr_pago |
 |      1 | Jef     | 10/02/2018 |      8471 |      100 |     8371 |
 |      2 | carlos  | 20/02/2018 |           |          |          |


 #+Name: Tabela de itens da compra do jeferson
 | id_item | id_venda | id_hardware      | qtde_item | total_ite |   |
 |       1 |        1 | 1 (gabinete)     |        10 |    605.00 |   |
 |       2 |        1 | 2 (processador)  |        10 |   3005.00 |   |
 |       3 |        1 | 3 (placa mae)    |        10 |   1050.00 |   |
 |       4 |        1 | 4 (Disco Rigido) |        10 |    809.00 |   |
 |       5 |        1 | 5                |        10 |   3002.00 |   |
 |         |          |                  |           |     8471. |   |
 |         |          |                  |           |           |   |
 #+TBLFM: @7$5=vsum(@2..@6

Tabela de itens da compra do carlos
 | id_item | id_venda | id_hardware      | qtde_item | total_ite |   |
 |       6 |        2 | 1 (gabinete)     |         1 |    60.50  |   |
 |       7 |        2 | 2 (processador)  |         1 |    300.50 |   |
 |       8 |        2 | 3 (placa mae)    |         1 |    105.00 |   |
 |       9 |        2 | 4 (Disco Rigido) |         1 |     80.90 |   |
 |         |          |                  |           |    1086.9 |   |
 |         |          |                  |           |           |   |

 #+TBLFM: @6$5=vsum(@2..@5)

    #+name: inserts
    #+begin_src sh :results output replace  :exports both
      docker exec mssql-server /opt/mssql-tools/bin/sqlcmd -S localhost -U SA -P Aluno#123 -i /sql_scripts/inserts.sql
    #+end_src

    #+RESULTS: inserts
    #+begin_example
    Changed database context to 'lojainfo'.
    Lembra que a gente tinha inserido alguns registros sï¿½ pra mostrar que nossas tabelas haviam sido criadas?
    Pois ï¿½. Agora vamos zerar esses registros
    Entao, apagando registro anteriores...

    (5 rows affected)
    ==============================================
    Agora sim, Inserindo alguns clientes

    (3 rows affected)
    select * from tb_clientes
    id_cliente  nome                                               endereco                                                                                             fone            email                                                                 
    ----------- -------------------------------------------------- ---------------------------------------------------------------------------------------------------- --------------- ----------------------------------------------------------------------
              2 Jeferson                                           Aguia Haia 123                                                                                       11-99999-9999   jef@dom.com                                                           
              3 Carlos                                             Aguia Haia 456                                                                                       11-99999-9999   carlos@dom.com                                                        
              4 Ralf                                               Aguia Haia 789                                                                                       11-99999-9999   ralf@dom.com                                                          
              5 Jeferson                                           Aguia Haia 123                                                                                       11-99999-9999   jef@dom.com                                                           
              6 Carlos                                             Aguia Haia 456                                                                                       11-99999-9999   carlos@dom.com                                                        
              7 Ralf                                               Aguia Haia 789                                                                                       11-99999-9999   ralf@dom.com                                                          
              8 Jeferson                                           Aguia Haia 123                                                                                       11-99999-9999   jef@dom.com                                                           
              9 Carlos                                             Aguia Haia 456                                                                                       11-99999-9999   carlos@dom.com                                                        
             10 Ralf                                               Aguia Haia 789                                                                                       11-99999-9999   ralf@dom.com                                                          

    (9 rows affected)
    ==============================================
    Agora inserindo alguns hardwares...

    (5 rows affected)
    select * from tb_hardware
    id_hardware descricao                                          preco_unit           qtde_atual  qtde_minima img                                                                                                                                                                                                                                                             
    ----------- -------------------------------------------------- -------------------- ----------- ----------- ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              4 gabinete                                                             61         100          10 NULL                                                                                                                                                                                                                                                            
              5 gabinete                                                             61         100          10 NULL                                                                                                                                                                                                                                                            
              6 processador                                                         301         100          10 NULL                                                                                                                                                                                                                                                            
              7 placa m?e                                                           101         100          10 NULL                                                                                                                                                                                                                                                            
              8 Dico R?gido                                                          81         100          10 NULL                                                                                                                                                                                                                                                            
              9 Monitor                                                             300         100          10 NULL                                                                                                                                                                                                                                                            
             10 gabinete                                                             61         100          10 NULL                                                                                                                                                                                                                                                            
             11 processador                                                         301         100          10 NULL                                                                                                                                                                                                                                                            
             12 placa m?e                                                           101         100          10 NULL                                                                                                                                                                                                                                                            
             13 Dico R?gido                                                          81         100          10 NULL                                                                                                                                                                                                                                                            
             14 Monitor                                                             300         100          10 NULL                                                                                                                                                                                                                                                            
             15 gabinete                                                             61         100          10 NULL                                                                                                                                                                                                                                                            
             16 processador                                                         301         100          10 NULL                                                                                                                                                                                                                                                            
             17 placa m?e                                                           101         100          10 NULL                                                                                                                                                                                                                                                            
             18 Dico R?gido                                                          81         100          10 NULL                                                                                                                                                                                                                                                            
             19 Monitor                                                             300         100          10 NULL                                                                                                                                                                                                                                                            

    (16 rows affected)
    ==============================================
    Inserindo a Venda para os clientes Jeferson e Carlos

    (2 rows affected)
    select * from tb_vendas
    id_venda    id_cliente  data             vlr_total  desconto   vlr_pago  
    ----------- ----------- ---------------- ---------- ---------- ----------
              2           2       2018-02-10    8471.00     100.00    8371.00
              3           3       2018-02-10    1086.00        .00    1086.00
              4           2       2018-02-10    8471.00     100.00    8371.00
              5           3       2018-02-10    1086.00        .00    1086.00
              6           2       2018-02-10    8471.00     100.00    8371.00
              7           3       2018-02-10    1086.00        .00    1086.00

    (6 rows affected)
    ==============================================
    Inserindo itens da compra do Jerferson

    (5 rows affected)
    Inserindo itens da compra do Carlos

    (5 rows affected)
    select * from tb_vendas_itens
    id_item     id_venda    id_hardware qtde_item   total_item
    ----------- ----------- ----------- ----------- ----------
             13           2           4          10     600.50
             14           2           5          10    3005.00
             15           2           6          10    1050.00
             16           2           7          10     809.00
             17           2           8          10    3002.00
             18           2           4           1      60.50
             19           3           5           1     300.50
             20           3           6           1     105.00
             21           3           7           1      80.90
             22           3           8           1    3002.00

    (10 rows affected)
    #+end_example



